{
    "theme": "Moonlit Grotto",
    "description": "As you step through the shimmering curtains of mist, you find yourself within a vast, crystal-lined chamber deep beneath the moon's silvery gaze. The air is alive with the soft luminescence of glowworms and the gentle rustle of subterranean waterways. The walls, polished to an ethereal sheen by centuries of dripping moisture, seem to hum softly in harmony with the distant song of a secret river. Unseen currents weave through the cavern, carrying scents of damp earth, salt spray, and the faint tang of forgotten treasures. The darkness is illuminated by an ethereal glow, as if the moon itself had descended to guide those brave enough to delve into this mystical realm.",
    "rooms": [
        {
            "description": "The air is alive with the soft luminescence of glowworms and the gentle rustle of subterranean waterways. The walls, polished to an ethereal sheen by centuries of dripping moisture, seem to hum softly in harmony with the distant song of a secret river. Unseen currents weave through the cavern, carrying scents of damp earth, salt spray, and the faint tang of forgotten treasures.",
            "name": "The Whispering Grotto",
            "properties": [
                "illuminated",
                "wet"
            ],
            "secrets": "A hidden passage behind the crystal cluster leads to a secret chamber containing ancient artifacts and cryptic messages. The path is indicated by a series of subtle changes in the wall's luminescence.",
            "room_id": 1,
            "coordinates": [
                1,
                1
            ],
            "connections": [
                [
                    2,
                    1
                ],
                [
                    1,
                    2
                ]
            ],
            "items_file": "room_items\\room_1_items.json"
        },
        {
            "description": "As you venture deeper into the Moonlit Grotto, a chamber of eerie tranquility unfolds before you. The air is heavy with the scent of damp earth and the faint tang of forgotten treasures. A series of crystal formations embedded within the walls seem to capture the lunar cycle, their facets reflecting hues of moonlit silver and dark blue. In the center of this space stands an ancient statue, its features worn by time but radiating a gentle, ethereal glow.",
            "name": "The Lunar Sanctum",
            "properties": [
                "illuminated",
                "cold"
            ],
            "secrets": "A hidden compartment within the statue contains a message from an ancient civilization, detailing a celestial alignment crucial for unlocking the secrets of this mystical realm. The path is indicated by subtle changes in the crystal formations' luminescence.",
            "room_id": 2,
            "coordinates": [
                1,
                2
            ],
            "connections": [
                [
                    1,
                    1
                ]
            ],
            "items_file": "room_items\\room_2_items.json"
        },
        {
            "description": "The chamber deepens into a vast, crystal-lined space where moonbeams converge, casting a sea of silver light upon the polished walls. Unseen currents whisper through the cavern, carrying scents of salt spray and forgotten treasures. A faint melody drifts from an unseen source, harmonizing with the gentle hum of the crystals.",
            "name": "The Lunar Convergence",
            "properties": [
                "illuminated",
                "cold"
            ],
            "secrets": "A hidden panel within the crystal formation contains a cryptic message from an ancient civilization, detailing a lunar alignment crucial for unlocking the secrets of this mystical realm. The path is indicated by subtle changes in the crystals' luminescence and the soft melody's tempo.",
            "room_id": 3,
            "coordinates": [
                2,
                1
            ],
            "connections": [
                [
                    1,
                    1
                ]
            ],
            "items_file": "room_items\\room_3_items.json"
        }
    ]
}