{
    "theme": "Moonlit Masquerade",
    "description": "The entrance to the Moonlit Masquerade lies hidden behind a tapestry of tangled vines and overgrown bushes, as if nature itself sought to conceal the grandeur within. A crescent moon casts an ethereal glow upon the structure's facade, where intricate carvings of masks and celestial bodies dance across the walls in a whimsical display of artistry. The air is heavy with the scent of lavender and the distant hum of nocturnal insects, adding to the mystique of this enchanted place. Inside, crystal chandeliers refract hues of blue and purple, casting an otherworldly ambiance throughout the labyrinthine corridors and opulent chambers. Strange whispers echo through the halls, seemingly emanating from the very masks that adorn the walls, making one question the true nature of this masquerade. As adventurers navigate deeper into the Moonlit Masquerade, they begin to unravel a web of secrets tied to an ancient cult of performers who weaved magic into their art, leaving behind a legacy both captivating and treacherous.",
    "rooms": [
        {
            "description": "A grand ballroom with a crystal-encrusted chandelier at its center. The walls are adorned with an assortment of ornate masks in various shapes and sizes, their faces seeming to shift as the moonlight dances across them. A delicate dance of shadows is played out on the floor, where fragments of forgotten performances appear to still linger.",
            "name": "The Masquerade Ballroom",
            "properties": [
                "illuminated",
                "sensitive_to_noise"
            ],
            "secrets": "A hidden compartment within one of the masks conceals a note with an enigmatic poem that reads: 'Where shadows dance and moonlight gleams, seek the melody that echoes through dreams.'",
            "room_id": 1,
            "coordinates": [
                1,
                2
            ],
            "connections": [
                [
                    2,
                    2
                ]
            ],
            "items_file": "room_items\\room_1_items.json"
        },
        {
            "description": "A narrow corridor lined with cobweb-covered portraits of performers from a bygone era. The walls are adorned with the remnants of once-grand tapestries, now faded and frayed. A faint scent of lavender wafts through the air, mingling with the musty smell of aged wood. The only light comes from a series of flickering candles, casting eerie shadows on the walls as they dance to the rhythm of distant music.",
            "name": "The Forgotten Gallery",
            "properties": [
                "dark",
                "fragrant"
            ],
            "secrets": "A hidden compartment within one of the portraits conceals a tiny music box playing an enchanting melody when wound. The tune seems to match the rhythm of distant laughter and applause, hinting at a deeper connection between this room and the heart of the Moonlit Masquerade.",
            "room_id": 2,
            "coordinates": [
                2,
                1
            ],
            "connections": [
                [
                    2,
                    2
                ]
            ],
            "items_file": "room_items\\room_2_items.json"
        },
        {
            "description": "A grand concert hall filled with rows of velvet-draped seats, each one adorned with a delicate mask that seems to have been hand-carved from the finest ebony wood. The air is heavy with the scent of sandalwood and old books, as if the very essence of forgotten performances still lingers within these walls. A grand organ stands at the far end, its pipes reaching towards the moonlit ceiling like skeletal fingers, playing a haunting melody that seems to be woven from the very fabric of dreams.",
            "name": "The Whispering Auditorium",
            "properties": [
                "illuminated",
                "acoustic"
            ],
            "secrets": "A hidden panel within one of the organ's pipes conceals a small note with a cryptic message that reads: 'Seek out the melody that echoes through dreams, for it is there that you will find the key to unraveling the secrets of the Moonlit Masquerade.'",
            "room_id": 3,
            "coordinates": [
                2,
                2
            ],
            "connections": [
                [
                    1,
                    2
                ],
                [
                    2,
                    1
                ]
            ],
            "items_file": "room_items\\room_3_items.json"
        }
    ]
}