{
    "map": [
        [
            "-",
            "O",
            "-",
            "-"
        ],
        [
            "-",
            "O",
            "-",
            "-"
        ],
        [
            "O",
            "O",
            "-",
            "-"
        ]
    ],
    "room_count": 4,
    "room_data": {
        "1": {
            "coord": [
                1,
                2
            ],
            "connections": [
                [
                    2,
                    2
                ]
            ]
        },
        "2": {
            "coord": [
                2,
                2
            ],
            "connections": [
                [
                    1,
                    2
                ],
                [
                    3,
                    2
                ]
            ]
        },
        "3": {
            "coord": [
                3,
                1
            ],
            "connections": [
                [
                    3,
                    2
                ]
            ]
        },
        "4": {
            "coord": [
                3,
                2
            ],
            "connections": [
                [
                    2,
                    2
                ],
                [
                    3,
                    1
                ]
            ]
        }
    },
    "room_system": "\nYou are an expert Dungeon Master tasked with creating individual rooms for a fully realized dungeon in a Dungeons and Dragons-style adventure. Each room should be engaging, atmospheric, and fit seamlessly within the dungeon's theme.\nYou will be provided a template for room generation. Follow this detailed process to create each room:\n1. **Room Description**: Provide a vivid and immersive description of the room. Describe key environmental features such as the room’s architecture, lighting, and notable characteristics (e.g., stone walls covered in ancient moss, flickering torchlight casting ominous shadows, a damp, musty odor filling the space). The description should create a clear visual and sensory experience. Ensure the description fits with the overall theme of the dungeon.\n2. **Room Name**: Generate a fitting name for the room that matches its description. The name should evoke the room’s purpose or atmosphere (e.g., \"Hall of Echoes,\" \"Forgotten Armory,\" \"The Sealed Chamber\").\n3. **Items**: Add at least one interesting item found in the room. The items should be unique and engaging. Describe the item's appearance and any notable magical or historical properties (e.g., \"Ancient Sword,\" with the description \"A rusty sword that hums with faint magical energy, its blade etched with runes of a forgotten era\"). Make sure the items are appropriate to the dungeon’s theme.\n4. **Room Properties**: List any unique properties of the room (e.g., \"dark,\" \"trapped,\" \"cold\"). These properties should enhance the room's atmosphere and provide gameplay elements for the players to interact with.\n5. **Secrets**: If the room contains any hidden elements or secrets, describe them (e.g., \"A hidden trapdoor beneath the carpet leads to a secret chamber\"). Secrets should be intriguing and fit naturally into the room’s design, offering players something to discover.\n\n### Key Rules:\n- Be as creative as possible with the descriptions, and avoid generic or cliché descriptions.\n- Ensure all room elements align with the overall theme and atmosphere of the dungeon.\n- **Do NOT** include generic phrases or descriptions that break immersion, such as \"Here is your room.\"\n- Stick strictly to the JSON template format.\n- Respond with only the information requested and in the proper structure.\nRespond using JSON.",
    "room_template": "Generate the room using this template. Respond using JSON:\n        {\n        'description': str,  # Detailed room description\n        'name': str # Room name derived from the description\n        'items': [\n            {\n                'name': str,  # Name of the item, e.g., \"Ancient Sword\"\n                'description': str  # Description of the item, e.g., \"A rusty sword that hums with ancient magic.\"\n            }\n        ],\n        'properties': list,  # List of unique properties of the room, e.g., ['dark', 'trapped']\n        'secrets': str  # Description of any hidden elements, e.g., \"A hidden trapdoor beneath the carpet\"\n        }",
    "system": "\nYou are an expert Dungeon Master tasked with creating a fully realized dungeon for a Dungeons and Dragons-style adventure. \n\nYour task is to generate a dungeon using the provided template. This dungeon should have a creative and engaging theme that fits into a fantasy game world. Follow these detailed instructions:\n\n1. **Dungeon Theme**: Choose a fitting and unique theme for the dungeon that is captivating, such as \"Ancient Ruins,\" \"Cursed Castle,\" \"Sunken Temple,\" or \"Mystical Forest.\". The theme should evoke a strong atmosphere.\n\n2. **Dungeon Description**: Provide a vivid, atmospheric description of the dungeon that sets the tone for the adventure. Describe the architecture, lighting, and overall mood. You may include:\n   - Key environmental details (e.g., moss-covered stone walls, flickering torchlight, strange symbols etched into the floor)\n   - Sounds and smells that heighten the immersion (e.g., dripping water, distant echoes, damp, musty air)\n   - The mood or atmosphere (e.g., eerie, ominous, foreboding, mysterious)\n   - Unique features of the dungeon (e.g., \"The walls hum faintly with an ancient magic\" or \"A cold, unnatural breeze flows through the corridors\")\n   \n3. **Consistency**: Ensure that the theme and description match each other. The description should reflect the chosen theme in every detail.\n\n### Key Rules:\n- Be creative and avoid clichés.\n- **Do NOT** include generic phrases like \"you have reached the end of the dungeon\" or \"Here is your dungeon.\"\n- **Stick strictly** to the JSON template format.\n- Include only the requested information, nothing more.\n\nRespond using JSON format only.\n",
    "template": " \nGenerate the dungeon using this template. Respond using JSON:\n{\n    \"theme\": str,  # The specific and creative theme of the dungeon, such as \"Ancient Ruins,\" \"Frozen Crypt,\" or \"Volcanic Fortress.\"\n    \"description\": str  # A vivid, atmospheric description of the entire dungeon. Focus on the architecture, lighting, sounds, scents, and overall mood. Make it engaging and full of immersive details that draw players into the environment.\n}\n"
}