{
    "theme": "Moonlit Maze",
    "description": "The Moonlit Maze sprawls across a vast, silver-sand plain like an ethereal labyrinth. Towering crystal spires, their facets glinting in the lunar light, serve as natural walls, channeling the players through a serpentine path of shimmering white stone and glittering stardust. As they navigate the twisting corridors, the soft whisper of celestial music drifts on the breeze, weaving an otherworldly melody that seems to change pitch with each step. Dappled shadows dance across the walls as wispy, luminescent tendrils sprout from the ground, imbuing the air with an essence of moonflowers and stardust. The scent of starlight and forgotten memories wafts through the maze, beckoning adventurers deeper into its shimmering depths.",
    "rooms": [
        {
            "description": "This winding gallery stretches into the heart of the Moonlit Maze like a shimmering tendril of moonlight. The walls, crafted from a glittering white stone that seems almost liquid in the lunar light, are adorned with intricate carvings that depict scenes from celestial mythology. As you step into this ethereal space, the soft music of the maze deepens, weaving an enchanting melody around you. The air is filled with the sweet scent of moonflowers and stardust.",
            "name": "Gallery of Lunar Tales",
            "items": [
                {
                    "name": "Celestial Lyre",
                    "description": "A delicate lyre that shines like a fallen star, its strings humming with an otherworldly music that seems to echo the secrets of the universe. As you lift it, the instrument begins to play a haunting melody that resonates deep within your soul."
                }
            ],
            "properties": [
                "moonlit",
                "enchanted"
            ],
            "secrets": "A hidden compartment in the lyre contains a cryptic poem etched on a piece of moonstone, hinting at a hidden portal somewhere within the maze.",
            "room_id": 1,
            "coordinates": [
                1,
                1
            ],
            "connections": [
                [
                    2,
                    1
                ]
            ]
        },
        {
            "description": "This circular room is filled with an eerie, pulsating glow that seems to emanate from the very walls themselves. The crystal spires outside appear to be arranged in a deliberate pattern, casting an ever-changing kaleidoscope of colors across the floor. A series of delicate, luminescent orbs hang from the ceiling, casting an ethereal light upon the room's inhabitants. The air is heavy with the scent of moonflowers and stardust.",
            "name": "Chamber of Celestial Illumination",
            "items": [
                {
                    "name": "Stellar Chalice",
                    "description": "A delicate, crystal chalice that contains a swirling vortex of colors, seemingly drawn from the very essence of the stars themselves. As you lift it, the colors begin to swirl and dance within the cup, imbuing you with visions of distant worlds and forgotten knowledge."
                }
            ],
            "properties": [
                "moonlit",
                "enchanted"
            ],
            "secrets": "A hidden compartment in the wall contains a cryptic poem etched on a piece of polished moonstone, hinting at a powerful celestial artifact hidden somewhere within the maze. The compartments can be opened by solving a complex pattern of colors cast by the crystal spires outside.",
            "room_id": 2,
            "coordinates": [
                2,
                1
            ],
            "connections": [
                [
                    1,
                    1
                ],
                [
                    2,
                    2
                ]
            ]
        },
        {
            "description": "This tranquil pool of stardust fills a natural amphitheater within the Moonlit Maze. The walls, composed of glittering white stone, are adorned with intricate carvings that depict scenes from celestial mythology. As night falls, the sky above transforms into a canvas of twinkling stars, and the air is filled with the sweet scent of moonflowers and stardust. A delicate, crystal bridge spans the pool, connecting two distant points within the maze.",
            "name": "Pool of Stardust",
            "items": [
                {
                    "name": "Cosmic Tear",
                    "description": "A delicate droplet of stardust that glistens like a fallen star. As you lift it, the tear begins to glow with an otherworldly light, imbuing you with visions of distant worlds and forgotten knowledge."
                }
            ],
            "properties": [
                "moonlit",
                "enchanted"
            ],
            "secrets": "A hidden compartment beneath the crystal bridge contains a cryptic poem etched on a piece of polished moonstone, hinting at a hidden portal somewhere within the maze. The compartments can be opened by solving a complex pattern of starlight cast across the pool's surface.",
            "room_id": 3,
            "coordinates": [
                2,
                2
            ],
            "connections": [
                [
                    2,
                    1
                ]
            ]
        }
    ]
}