{
    "name": "Forest Troll",
    "type": "Monstrosity",
    "alignment": "Chaotic Evil",
    "size": "Large",
    "hit_points": {
      "average": 84,
      "formula": "8d10 + 40"
    },
    "armor_class": 15,
    "speed": {
      "walk": "30 ft",
      "swim": "20 ft"
    },
    "abilities": {
      "strength": 20,
      "dexterity": 12,
      "constitution": 18,
      "intelligence": 7,
      "wisdom": 9,
      "charisma": 6
    },
    "saving_throws": {
      "strength": "+6",
      "constitution": "+5"
    },
    "skills": {
      "perception": "+2",
      "stealth": "+3"
    },
    "damage_resistances": [
      "bludgeoning",
      "piercing"
    ],
    "damage_immunities": [],
    "condition_immunities": [],
    "senses": {
      "darkvision": "60 ft",
      "passive_perception": 12
    },
    "languages": [
      "Giant"
    ],
    "challenge_rating": 5,
    "traits": [
      {
        "name": "Regeneration",
        "description": "The troll regains 10 hit points at the start of its turn if it has at least 1 hit point."
      },
      {
        "name": "Keen Smell",
        "description": "The troll has advantage on Wisdom (Perception) checks that rely on smell."
      }
    ],
    "actions": [
      {
        "name": "Multiattack",
        "description": "The troll makes three attacks: one with its bite and two with its claws."
      },
      {
        "name": "Bite",
        "description": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 10 (1d10 + 5) piercing damage.",
        "damage": {
          "type": "piercing",
          "formula": "1d10 + 5"
        }
      },
      {
        "name": "Claw",
        "description": "Melee Weapon Attack: +7 to hit, reach 5 ft., one target. Hit: 12 (2d6 + 5) slashing damage.",
        "damage": {
          "type": "slashing",
          "formula": "2d6 + 5"
        }
      }
    ],
    "legendary_actions": [],
    "lair_actions": [],
    "description": {
      "appearance": "The Forest Troll is a towering, green-skinned creature with matted, moss-covered hair and long claws that ooze with grime. Its skin is thick and leathery, giving it a natural resilience. The stench of decay clings to it, and small fungi grow in patches across its body, blending it into its forest environment.",
      "habitat": "Forest Trolls dwell deep in ancient forests, often in damp caves or by riverbanks. They prefer secluded areas far from civilization, where they can ambush unsuspecting travelers or hunt for prey.",
      "lore": "Legends speak of Forest Trolls as ancient guardians of the wilds, corrupted by dark magic. While some believe they were once protectors of the forest, their chaotic nature now makes them a threat to all living things. They have an insatiable hunger and are known to devour anything they come across, including other trolls."
    },
    "behavior": {
      "aggression": "Forest Trolls are highly aggressive and territorial, attacking intruders on sight. They will pursue prey relentlessly, even into water, where their swimming ability allows them to ambush enemies.",
      "tactics": "In combat, the Forest Troll relies on brute strength and savagery. It often tries to overpower weaker foes with its claws and teeth, focusing on one target at a time. If it faces resistance, it may attempt to retreat temporarily to regenerate its wounds before re-engaging.",
      "hunting_style": "Forest Trolls are ambush predators. They use their keen sense of smell to track prey from afar and often lay in wait among the trees or in shallow water before launching a sudden attack.",
      "fear_responses": "While aggressive, Forest Trolls fear fire above all else due to their regenerative abilities being hindered by it. They are also known to avoid direct confrontations with groups of heavily armored foes."
    }
  }