{
    "theme": "Moonlit Mirage",
    "description": "The Moonlit Mirage is an otherworldly dungeon built within a series of shifting sand dunes, as if the very desert itself had been sculpted into labyrinthine corridors and crystal-filled caverns. The air is alive with the soft whispers of forgotten memories and the faint scent of starlight, carried on the breeze that stirs the constantly rearranging sands. Towering crystal spires jut from the ground like shards of broken moonlight, their facets reflecting a kaleidoscope of colors across the shifting dunes. Flickering lanterns crafted from delicate shells cast an ethereal glow, illuminating the paths through this surreal expanse. As you navigate the ever-changing maze, the whispers grow louder, urging you deeper into the heart of the Mirage.",
    "rooms": [
        {
            "description": "The room remains vast and cavernous, its stone walls unfolding like instruments of sound and light. The air is still alive with an otherworldly energy, resonating in harmony with the Moonlit Harp's melody. The crystal shard at the center now pulses with a brilliant, turquoise light that seems to emanate from your landing point, its increased vitality reflecting off nearby stone facets in a dazzling display of colors and patterns. The Moonlit Harp stands elevated, its carvings vibrating in perfect harmony with the harp's melody as it hovers above the ground, blending celestial music with a gentle lunar essence that resonates throughout the space. A revised spiral pattern now unfolds from your landing point, its intricate design perfectly complementing the harp's lively and dynamic rhythm in harmony with your controlled backflip. The colors and patterns dancing across the walls and facets seem to have taken on an even more vibrant tone, as if echoing the thrill of your impressive acrobatic display and the harmonious synchrony between you and the Moonlit Harp.",
            "name": "The Serene Oasis",
            "properties": [
                "serene",
                "illuminated"
            ],
            "secrets": "Hidden behind a falling curtain of crystal water is an ancient inscription etched into the moonstone stones, reading 'The Mirrors Reflect'.",
            "room_id": 1,
            "coordinates": [
                1,
                2
            ],
            "connections": [
                [
                    2,
                    2
                ]
            ],
            "items_file": "./profiles/Garry/dungeon_dir/room_items/room_1_items.json"
        },
        {
            "description": "As you venture deeper into The Moonlit Mirage, this room unfolds like a canvas of shifting moonlight. Towering crystal spires pierce the ceiling, their facets reflecting a mesmerizing dance of colors across the walls, where an emerald green stain now radiates from the floor to the base of one sapphire-hued spire. Softly glowing lanterns crafted from delicate shells cast an ethereal glow, illuminating pathways through the ever-changing maze, but also casting eerie shadows on the newly-greened crystal surfaces. The air is alive with the whispers of forgotten memories, each one echoing off the crystal formations like a whispered secret, now accompanied by the faint scent of something bitter and acrid.",
            "name": "The Luminous Gallery",
            "properties": [
                "illuminated",
                "reflected"
            ],
            "secrets": "Hidden within the crystal formations is an ancient mechanism that, when triggered by the right sequence of whispers from the desert sands, reveals a hidden compartment containing a note with cryptic instructions.",
            "room_id": 2,
            "coordinates": [
                2,
                1
            ],
            "connections": [
                [
                    2,
                    2
                ]
            ],
            "items_file": "./profiles/Garry/dungeon_dir/room_items/room_2_items.json"
        },
        {
            "description": "As you step into this room, you're enveloped by the vibrant emerald coloration that still shrouds the shattered crystal spires, remnants of their former glory now lying amidst the stone floor. The dozen smaller shards of moonstone sparkle on the floor where the Lunar Essence Fragment once lay, its faint glow extinguished by your careful reassembly. With a soft hum growing stronger, the restored essence now shines at the center of the room, its delicate edges and facets intact. The air still carries the scent of starlight and ozone, but the whispers seem to have grown quiet amidst the restored balance.",
            "name": "The Whispered Serenade",
            "properties": [
                "haunting",
                "illuminated"
            ],
            "secrets": "Hidden within the harp's intricate carvings is a small compartment containing a delicate starlight-encrusted note that, when played on the right frequency by the harp's strings, reveals a hidden message etched into the crystal spires above.",
            "room_id": 3,
            "coordinates": [
                2,
                2
            ],
            "connections": [
                [
                    1,
                    2
                ],
                [
                    2,
                    1
                ]
            ],
            "items_file": "./profiles/Garry/dungeon_dir/room_items/room_3_items.json"
        }
    ]
}